#####
. .
.  .
.   .
 . .
 .  .
  . .

5-X+1=3
5-X+1=2
5-X+1=1

dots<X<=lava

#####
. . .

5-

#+begin_src python :results output
import math
print(math.factorial(5))
#+end_src

#+RESULTS:
: 120

#+begin_src rust :results output
fn main() {
    let lava = 5;
    let dots = 3;
    let mut res = 0;
    for i in dots+1..=lava {
        res += lava - i + 1;
        println!("{}", res);
    }
    println!("{}", res)
}
#+end_src

#+RESULTS:
: 2
: 3
: 3


https://topaz.github.io/paste/#XQAAAQDHAQAAAAAAAAAzHIoib6poHLpewxtGE3pTrRdzrponKxDhfDpmqUbmwK1em8UhjnLeDrUM3bsKz4hSbgD7CUhJSBIGPN/mApw6LX9zG4kfUZZnjHUIUtOF4oMg26UnM++K2N+xFQ8OYeb9dU0nwkpoHz7PJNjtodIAKf35QwKtUVpQd+OnVUDKbUmf98bqJBBa4FC9BOd1f/ffMndTlSVqA8mPRsBoOEnbsmvZ0gv7Op9TAfjlAltn32mJgeBWxi6npb/SeLmP7oaUv/78Ip2dSq249QYFowRhn7yFcVHmC0EQldFg4mnip2WBNYMDsU9DwwOgLELpNcg7IuMAQJRutahqqS8qDA2bwGXZH//BTtq5VCZMPqVEJr0GUprqNZY7VP/45+SO








7 - 4 - 2 - 1 + 1

?#?#?#?#?#?#?#? 1,3,1,6
 # ### # ######
 #
